# -*- coding: utf-8 -*-


#年度
YEAR_CHOICES =(
    ('2009', '2009'), 
    ('2010', '2010'), 
    ('2011', '2011'), 
    ('2012', '2012'),
    ('2013', '2013'), 
    ('2014', '2014'), 
)

#项目座落
COUNTY_CHOICES = (
    ('1',u"南昌县"),
    ('2',u"新建县"),
    ('3',u"进贤县"),
    ('4',u"安义县"),
    ('5',u"湾里区"),
    ('6',u"青山湖区"),
    ('7',u"东湖区"),
    ('8',u"西湖区"),
    ('9',u"青云谱区"),
    ('10',u"红谷滩新区"),
    ('11',u"高新区"),
    ('12',u"经济技术开发区"),
    ('13',u"桑海开发区"),
)

#项目类型
PROJECT_TYPE_CHOICES = (
    ('1',u"战略收储"),
    ('2',u"房地产（商品房）"),
    ('3',u"公共管理和服务"),
    ('4',u"民生保障（三房、农民建房、拆迁安置等）"),
    ('5',u"基础设施"),
    ('6',u"(工业、农业产业化、服务业)"),
)

#产业类型
INDUSTRY_TYPE_CHOICES = (
    ('2',u"金融产业"),
    ('3',u"区域性总部"),
    ('4',u"软件和服务外包产业"),
    ('5',u"物流产业"),
    ('6',u"生物农业"),
    ('7',u"汽车零部件业"),
    ('8',u"新能源汽车业"),
    ('9',u"生物医药业"),
    ('10',u"纺织服装产业"),
    ('11',u"有色金属工业"),
    ('12',u"健康消费"),
    ('13',u"光伏产业"),
    ('14',u"职业教育消费"),
    ('15',u"旅游集散"),
    ('16',u"航空装备业"),
    ('17',u"轨道交通装备业"),
    ('18',u"医疗器械业"),
    ('19',u"通信制造业"),
    ('20',u"文化创意产业"),
    ('21',u"新材料工业"),
    ('23',u"汽车整车业"),
    ('24',u"商业消费"),
    ('25',u"节能环保装备业"),
    ('26',u"LED产业"),
    ('27',u"风电产业"),
    ('28',u"钢铁工业"),
    ('29',u"食品业"),
    ('30',u"智能制造装备业"),
)

#土地使用类型 
GROUND_USE_TYPE_CHOICES = (
    ('2',u"批发零售用地"),
    ('3',u"住宿餐饮用地"),
    ('4',u"商务金融用地"),
    ('5',u"其它商服用地"),
    ('6',u"工业用地"),
    ('7',u"采矿用地"),
    ('8',u"仓储用地"),
    ('9',u"城镇住宅用地"),
    ('10',u"农村宅基地"),
    ('11',u"机关团体用地"),
    ('12',u"新闻出版用地"),
    ('13',u"科教用地"),
    ('14',u"医卫慈善用地"),
    ('15',u"文体娱乐用地"),
    ('16',u"公共设施用地"),
    ('17',u"公园与绿地"),
    ('18',u"风景名胜设施用地"),
    ('19',u"军事设施用地"),
    ('20',u"使领馆用地"),
    ('21',u"监教场所用地"),
    ('22',u"宗教用地"),
    ('23',u"殡葬用地"),
    ('24',u"铁路用地"),
    ('25',u"公路用地"),
    ('26',u"街巷用地"),
    ('27',u"农村道路"),
    ('28',u"机场用地"),
    ('29',u"港口码头用地"),
    ('30',u"管道运输用地"),
)

#指标类型
TARGET_TYPE_CHOICES = (
    ('1',u"县区级"),
    ('2',u"市级"),
    ('3',u"省级"),
    ('4',u"国家级")
)


